{
  "companyInformation": {
    "companyName": "GetPaid",
    "industry": "Fintech / Payment Processing",
    "companySize": "Startup (Early Stage)",
    "location": "Spain & Germany",
    "businessDescription": "GetPaid is a fintech startup focused on payment processing solutions. The company developed an innovative payment gateway prototype that successfully adapted to the Spanish and German markets, supporting seamless transactions for businesses in both regions."
  },
  "businessImpact": {
    "keyAchievements": [
      "Developed a payment gateway prototype that successfully adapted to Spain and Germany.",
      "Implemented card payments covering 75% of Spanish transactions and SEPA Direct Debit covering 80% of the German market.",
      "Supported a client processing payments for over two years, reaching €200,000 in monthly transaction volumes."
    ],
    "metricsAndResults": [
      "Contributed to securing a €6M seed funding round based on the prototype’s success.",
      "Ensured platform scalability and high availability through cloud infrastructure design.",
      "Improved traceability and transparency in financial transactions using an event-sourcing system."
    ]
  },
  "technicalContributions": {
    "keyProjects": [
      "Payment Gateway Prototype: Developed a high-performance unlicensed prototype supporting Spanish and German markets.",
      "Cloud Infrastructure for New Platform: Designed and maintained cloud architecture on Microsoft Azure, ensuring PCI compliance.",
      "Event-Sourcing & Actor-Based System: Created a scalable and traceable event-driven architecture with full system transparency."
    ],
    "technologiesUsed": {
      "languages": ["C#", ".NET"],
      "frameworks": ["Orleans (Actor Model)", "Kubernetes (K8s)"],
      "tools": ["Microsoft Azure", "Azure Key Vault", "SEPA Direct Debit", "PCI Compliance Standards"]
    },
    "technicalHighlights": [
      "Designed and deployed multiple Kubernetes clusters for high availability and scalability.",
      "Built a traceability-focused event-sourcing system ensuring data immutability and concurrency handling.",
      "Implemented a secure payment processing infrastructure, adhering to PCI compliance requirements."
    ]
  },
  "additionalNotes": [
    "Prototype adoption led to a successful seed funding round.",
    "Extensive experience in backend development, cloud infrastructure, and payment processing.",
    "Specialized in high-availability fintech solutions and distributed systems."
  ]
}