{
  "companyInformation": {
    "companyName": "Payvision",
    "industry": "Fintech / Payment Processing",
    "companySize": "Mid-sized (Acquired by ING)",
    "location": "Netherlands",
    "businessDescription": "Payvision specialized in payment processing, differentiating itself by integrating with multiple acquiring banks across various countries. This approach allowed merchants to process domestic payments efficiently, reducing cross-border fees and currency exchange costs."
  },
  "businessImpact": {
    "keyAchievements": [
      "Managed the core card payment processing system handling 90% of total transaction volume for over three years.",
      "Ensured a 24/7 payment infrastructure, processing up to 10,000 daily transactions.",
      "Successfully resolved two major outages caused by data center failures, maintaining business continuity."
    ],
    "metricsAndResults": [
      "Enabled merchants to reduce cross-border fees and currency exchange costs through domestic acquiring.",
      "Maintained PCI compliance and adapted systems to evolving regulations from Mastercard, Visa, and ECB.",
      "Strengthened high-availability infrastructure, ensuring mission-critical reliability in payments."
    ]
  },
  "technicalContributions": {
    "keyProjects": [
      "Core Card Payment Processing System: Maintained and optimized the platform responsible for most transactions.",
      "On-Premise HSM-Based Encryption System: Designed and deployed a hardware security module (HSM) solution for PCI compliance.",
      "Regulatory Compliance Upgrades: Regularly adapted systems to comply with evolving financial regulations."
    ],
    "technologiesUsed": {
      "languages": ["C#", ".NET"],
      "frameworks": ["PCI DSS Compliance", "HSM Encryption"],
      "tools": ["On-Premise Data Centers", "High-Availability Payment Systems"]
    },
    "technicalHighlights": [
      "Designed a secure card encryption system with key rotation, ensuring end-to-end PCI compliance.",
      "Optimized a mission-critical payment infrastructure, improving reliability and uptime.",
      "Led regulatory compliance adaptations, aligning with Mastercard, Visa, and European Central Bank (ECB) mandates."
    ]
  },
  "additionalNotes": [
    "Payvision was acquired by ING, validating its success as a robust payment platform.",
    "Gained deep expertise in high-availability payment systems, security, and regulatory compliance.",
    "Specialized in on-premise fintech infrastructure and secure transaction processing."
  ]
}