{
  "companyInformation": {
    "companyName": "Shift Technology",
    "industry": "Insurtech / SaaS",
    "companySize": "Mid-sized (Scale-up)",
    "location": "France",
    "businessDescription": "Shift Technology specializes in optimizing insurance claim management through advanced machine learning and predictive analytics. The company transforms fraud detection and claims processing into a scalable SaaS solution, helping insurers streamline operations and reduce fraud."
  },
  "businessImpact": {
    "keyAchievements": [
      "Enhanced software development practices to position the product as a top-tier SaaS solution.",
      "Optimized core fraud detection system, improving maintainability and performance.",
      "Integrated modern authentication and authorization mechanisms, enhancing security and user experience."
    ],
    "metricsAndResults": [
      "Contributed to productizing the company’s machine learning capabilities after a €220M Series C funding round.",
      "Increased release cadence by 2.5x while maintaining bug rates and SLA compliance.",
      "Improved deployment efficiency through CI/CD automation, accelerating feature delivery."
    ]
  },
  "technicalContributions": {
    "keyProjects": [
      "CI/CD Automation: Implemented and optimized pipelines to enhance deployment speed and stability.",
      "Code Refactoring & Performance Optimization: Improved software maintainability and efficiency.",
      "Observability & Logging: Standardized logging systems using Prometheus and Grafana."
    ],
    "technologiesUsed": {
      "languages": ["C#", "Typescript"],
      "frameworks": ["ASP .NET"],
      "tools": ["Kubernetes", "Docker", "Prometheus", "Grafana", "Auth0", "CI/CD (Jenkins, GitHub Actions)"]
    },
    "technicalHighlights": [
      "Increased system observability with standardized logging and monitoring.",
      "Improved test coverage and deployment automation for better reliability.",
      "Strengthened security through authentication standardization with Auth0."
    ]
  },
  "additionalNotes": [
    "Played a key role in transforming a specialized ML solution into a scalable SaaS platform.",
    "Extensive experience in automation, security, and observability in SaaS environments.",
    "Focused on improving scalability and engineering excellence in high-performance software development."
  ]
}